rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
/*
 * Copyright (c) 2024 Realtek Semiconductor Corp.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef PLATFORM_REG_H
#define PLATFORM_REG_H
#include <stdint.h>

/* ================================================================================ */
/* ================                PLATFORM Register               ================ */
/* ===========     Reference: Bee4_Reg_SoC_202201012_v0.xlsx     =========== */
/* ================================================================================ */
typedef struct
{
    /* 0x0000       0x4000_3000
        31:0    R/W    RSVD                            32'h0
    */
    __IO uint32_t RSVD_0000;

    /* 0x0004       0x4000_3004
        0       R/W1C  spic0_intr_r                    1'h0
        1       R/W1C  spic1_intr_r                    1'h0
        2       R/W1C  spic2_intr_r                    1'h0
        3       R/W1C  trng_intr_r                     1'h0
        4       R/W1C  lpcomp_intr_r                   1'h0
        5       R/W1C  spi_phy1_intr_r                 1'h0
        30:6    R      RSVD                            25'h0
        31      R/W1C  utmi_suspend_n_r                1'h0
    */
    union
    {
        __IO uint32_t REG_LOW_PRI_INT_STATUS;
        struct
        {
            __IO uint32_t spic0_intr_r: 1;
            __IO uint32_t spic1_intr_r: 1;
            __IO uint32_t spic2_intr_r: 1;
            __IO uint32_t trng_intr_r: 1;
            __IO uint32_t lpcomp_intr_r: 1;
            __IO uint32_t spi_phy1_intr_r: 1;
            __I uint32_t RESERVED_0: 25;
            __IO uint32_t utmi_suspend_n_r: 1;
        } BITS_004;
    } u_004;

    /* 0x0008       0x4000_3008
        31:0    R/W    low_pri_int_mode                32'hFFFFFFFF
    */
    union
    {
        __IO uint32_t REG_LOW_PRI_INT_MODE;
        struct
        {
            __IO uint32_t low_pri_int_mode: 32;
        } BITS_008;
    } u_008;

    /* 0x000C       0x4000_300c
        31:0    R/W    low_pri_int_en                  32'h0
    */
    union
    {
        __IO uint32_t REG_LOW_PRI_INT_EN;
        struct
        {
            __IO uint32_t low_pri_int_en: 32;
        } BITS_00C;
    } u_00C;

    /* 0x0010       0x4000_3010
        0       R      timer_intr1_intr0_r             1'h0
        1       R      bluewiz_intr_r                  1'h0
        2       R      RSVD                            1'h0
        3       R      bluewiz_dma_intr_r              1'h0
        4       R      pro_intr_r                      1'h0
        31:5    R      RSVD                            27'h0
    */
    union
    {
        __IO uint32_t BT_MAC_INTERRUPT;
        struct
        {
            __I uint32_t timer_intr1_intr0_r: 1;
            __I uint32_t bluewiz_intr_r: 1;
            __I uint32_t RESERVED_1: 1;
            __I uint32_t bluewiz_dma_intr_r: 1;
            __I uint32_t pro_intr_r: 1;
            __I uint32_t RESERVED_0: 27;
        } BITS_010;
    } u_010;

    /* 0x0014       0x4000_3014
        23:0     R       RSVD                                           24'h0
        26:24    R/W     RSVD                                           3'h0
        31:27    R       RSVD                                           5'h0
    */
    union
    {
        __IO uint32_t RXI_INTERRUPT;
        struct
        {
            __I uint32_t RESERVED_0: 32;
        } BITS_014;
    } u_014;

    /* 0x0018       0x4000_3018
        31:0    R/W    low_pri_int_pol                 32'h0
    */
    union
    {
        __IO uint32_t INTERRUPT_EDGE_OPTION;
        struct
        {
            __IO uint32_t low_pri_int_pol: 32;
        } BITS_018;
    } u_018;

    /* 0x001C       0x4000_301c
        11:0    RW     debug_sel                       12'h0
        15:12   R      RSVD                            4'h0
        23:16   R/W    can_dbg_sel                     8'h0
        24      R/W    can_dbg_en                      1'h0
        28:25   R      RSVD                            4'h0
        29      R/W    spi_speed_up_sim                1'h0
        30      R      RSVD                            1'h0
        31      R/W    RSVD                            1'h0
    */
    union
    {
        __IO uint32_t REG_DEBUG_SEL;
        struct
        {
            __IO uint32_t debug_sel: 12;
            __I uint32_t RESERVED_3: 4;
            __IO uint32_t can_dbg_sel: 8;
            __IO uint32_t can_dbg_en: 1;
            __I uint32_t RESERVED_2: 4;
            __IO uint32_t spi_speed_up_sim: 1;
            __I uint32_t RESERVED_1: 1;
            __IO uint32_t RESERVED_0: 1;
        } BITS_01C;
    } u_01C;

    /* 0x0014       0x4000_3014
        11:0     R       RSVD                                           12'h0
        31:12    R/W     RSVD                                           12'h0
    */
    union
    {
        __IO uint32_t REG_DATA_FIFO_SWAP_CTRL;
        struct
        {
            __I uint32_t RESERVED_0: 32;
        } BITS_020;
    } u_020;

    /* 0x0024       0x4000_3024
        0       R      timer0_toggle                   1'h0
        1       R      timer1_toggle                   1'h0
        2       R      timer2_toggle                   1'h0
        3       R      timer3_toggle                   1'h0
        4       R      timer4_toggle                   1'h0
        5       R      timer5_toggle                   1'h0
        6       R      timer6_toggle                   1'h0
        7       R      timer7_toggle                   1'h0
        8       R/W    spic0_mem_wr_en                 1'h0
        9       R/W    spic1_mem_wr_en                 1'h0
        10      R/W    spic2_mem_wr_en                 1'h0
        11      W1O    spic_mem_wr_lock                1'h0
        12      R/W    RSVD                            1'h0
        13      R/W    RSVD                            1'h0
        14      R/W    dmac_clk_always_disable         1'h0
        15      R/W    dmac_clk_always_enable          1'h1
        16      R/W    RSVD                            1'h0
        24:17   W1O    timer_dma_en                    1'h0
        26:25   R/W    uart_force_cg_en                2'h3
        31:27   R      RSVD                            5'h0
    */
    union
    {
        __IO uint32_t REG_MISC;
        struct
        {
            __I uint32_t timer0_toggle: 1;
            __I uint32_t timer1_toggle: 1;
            __I uint32_t timer2_toggle: 1;
            __I uint32_t timer3_toggle: 1;
            __I uint32_t timer4_toggle: 1;
            __I uint32_t timer5_toggle: 1;
            __I uint32_t timer6_toggle: 1;
            __I uint32_t timer7_toggle: 1;
            __IO uint32_t spic0_mem_wr_en: 1;
            __IO uint32_t spic1_mem_wr_en: 1;
            __IO uint32_t spic2_mem_wr_en: 1;
            __IO uint32_t spic_mem_wr_lock: 1;
            __IO uint32_t RESERVED_3: 1;
            __IO uint32_t RESERVED_2: 1;
            __IO uint32_t dmac_clk_always_disable: 1;
            __IO uint32_t dmac_clk_always_enable: 1;
            __IO uint32_t RESERVED_1: 1;
            __IO uint32_t timer_dma_en: 8;
            __IO uint32_t uart_force_cg_en: 2;
            __I uint32_t RESERVED_0: 5;
        } BITS_024;
    } u_024;

    /* 0x0028       0x4000_3028
        0       R/W    spic0_dma_tx_sel                1'h0
        1       R/W    spic0_dma_rx_sel                1'h0
        2       R/W    spic1_dma_tx_sel                1'h0
        3       R/W    spic1_dma_rx_sel                1'h0
        4       R/W    spic2_dma_tx_sel                1'h0
        5       R/W    spic2_dma_rx_sel                1'h0
        31:6    R      RSVD                            26'h0
    */
    union
    {
        __IO uint32_t REG_SPIC_DMAC_HS_SHARE;
        struct
        {
            __IO uint32_t spic0_dma_tx_sel: 1;
            __IO uint32_t spic0_dma_rx_sel: 1;
            __IO uint32_t spic1_dma_tx_sel: 1;
            __IO uint32_t spic1_dma_rx_sel: 1;
            __IO uint32_t spic2_dma_tx_sel: 1;
            __IO uint32_t spic2_dma_rx_sel: 1;
            __I uint32_t RESERVED_0: 26;
        } BITS_028;
    } u_028;

    /* 0x002C       0x4000_302c
        31:0    R      RSVD                            32'h0
    */
    union
    {
        __IO uint32_t REG_DMAC_SUSPEND_RESUME;
        struct
        {
            __I uint32_t RESERVED_0: 32;
        } BITS_02C;
    } u_02C;

    /* 0x0030       0x4000_3030
        0       R      km4_mve_inactive                1'h1
        1       R      km4_pbus_inactive               1'h1
        2       R      km4_tcm_dma_inactive            1'h1
        3       R      rxi350_dmac0_inactive           1'h1
        4       R      spic0_inactive                  1'h1
        5       R      spic1_inactive                  1'h1
        6       R      spic2_inactive                  1'h1
        7       R      spic0_mem_inactive              1'h1
        8       R      spic1_mem_inactive              1'h1
        9       R      spic2_mem_inactive              1'h1
        10      R      ppe_inactive                    1'h1
        11      R      display_inactive                1'h1
        12      R      usbotg_inactive                 1'h1
        13      R      sdio_host0_inactive             1'h1
        14      R      gmac_inactive                   1'h1
        15      R      gmac_ctrl_inactive              1'h1
        31:16   R      RSVD                            16'h0
    */
    union
    {
        __IO uint32_t REG_PLATFORM_STATUS;
        struct
        {
            __I uint32_t km4_mve_inactive: 1;
            __I uint32_t km4_pbus_inactive: 1;
            __I uint32_t km4_tcm_dma_inactive: 1;
            __I uint32_t rxi350_dmac0_inactive: 1;
            __I uint32_t spic0_inactive: 1;
            __I uint32_t spic1_inactive: 1;
            __I uint32_t spic2_inactive: 1;
            __I uint32_t spic0_mem_inactive: 1;
            __I uint32_t spic1_mem_inactive: 1;
            __I uint32_t spic2_mem_inactive: 1;
            __I uint32_t ppe_inactive: 1;
            __I uint32_t display_inactive: 1;
            __I uint32_t usbotg_inactive: 1;
            __I uint32_t sdio_host0_inactive: 1;
            __I uint32_t gmac_inactive: 1;
            __I uint32_t gmac_ctrl_inactive: 1;
            __I uint32_t RESERVED_0: 16;
        } BITS_030;
    } u_030;

