rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
    /* 0x0034       0x4000_3034
        0       R/W    km4_nmi_ctrl_enable             1'h0
        31:1    R      RSVD                            31'h0
    */
    union
    {
        __IO uint32_t REG_KM4_NMI_CTRL;
        struct
        {
            __IO uint32_t km4_nmi_ctrl_enable: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_034;
    } u_034;

    __IO uint32_t RSVD_0x38[5];

    /* 0x004C       0x4000_304c
        0       R/W    data_ram_err_flag_en            1'h0
        1       R/W    data_ram_err_int_en             1'h0
        2       R/W    data_ram_err_flag_clr           1'h0
        3       R/W    data_ram_err_int_clr            1'h0
        10:4    R      RSVD                            7'h0
        27:11   R      data_ram_err_flag_addr          17'h0
        28      R      data_ram_err_flag_we            1'h0
        29      R      data_ram_err_flag_re            1'h0
        30      R      data_ram_err_flag_valid         1'h0
        31      R      data_ram_err_int                1'h0
    */
    union
    {
        __IO uint32_t REG_DATA_RAM_ERR_FLAG;
        struct
        {
            __IO uint32_t data_ram_err_flag_en: 1;
            __IO uint32_t data_ram_err_int_en: 1;
            __IO uint32_t data_ram_err_flag_clr: 1;
            __IO uint32_t data_ram_err_int_clr: 1;
            __I uint32_t RESERVED_0: 7;
            __I uint32_t data_ram_err_flag_addr: 17;
            __I uint32_t data_ram_err_flag_we: 1;
            __I uint32_t data_ram_err_flag_re: 1;
            __I uint32_t data_ram_err_flag_valid: 1;
            __I uint32_t data_ram_err_int: 1;
        } BITS_04C;
    } u_04C;

    /* 0x0050       0x4000_3050
        31:0    R/W    km4_keep_0                      32'h0
    */
    union
    {
        __IO uint32_t REG_KM4_KEEP_0_BOUNDARY;
        struct
        {
            __IO uint32_t km4_keep_0: 32;
        } BITS_050;
    } u_050;

    /* 0x0054       0x4000_3054
        31:0    R/W    km4_keep_1                      32'hFFFFFFFF
    */
    union
    {
        __IO uint32_t REG_KM4_KEEP_1_BOUNDARY;
        struct
        {
            __IO uint32_t km4_keep_1: 32;
        } BITS_054;
    } u_054;

    /* 0x0058       0x4000_3058
        31:0    R/W    km4_initpbusrange               32'h4000E000
    */
    union
    {
        __IO uint32_t REG_KM4_INITPBUSRANGE;
        struct
        {
            __IO uint32_t km4_initpbusrange: 32;
        } BITS_058;
    } u_058;

    /* 0x005C       0x4000_305c
        31:0    R/W    km4_initzwfrange                32'h0
    */
    union
    {
        __IO uint32_t REG_KM4_INITZWFRANGE;
        struct
        {
            __IO uint32_t km4_initzwfrange: 32;
        } BITS_05C;
    } u_05C;

    /* 0x0060       0x4000_3060
        26:0    R/W    km4_init_xo_range_top           27'h00000ff
        27      R/W    km4_init_xo_range_en            1'h1
        28      W1O    km4_xo_range_lock               1'h0
        31:29   R      RSVD                            3'h0
    */
    union
    {
        __IO uint32_t REG_KM4_XO_CFG_0;
        struct
        {
            __IO uint32_t km4_init_xo_range_top: 27;
            __IO uint32_t km4_init_xo_range_en: 1;
            __IO uint32_t km4_xo_range_lock: 1;
            __I uint32_t RESERVED_0: 3;
        } BITS_060;
    } u_060;

    /* 0x0064       0x4000_3064
        26:0    R/W    km4_init_xo_range_base          27'h0
        31:27   R      RSVD                            5'h0
    */
    union
    {
        __IO uint32_t REG_KM4_XO_CFG_1;
        struct
        {
            __IO uint32_t km4_init_xo_range_base: 27;
            __I uint32_t RESERVED_0: 5;
        } BITS_064;
    } u_064;

    /* 0x0068       0x4000_3068
        0       R/W    km4_retention_mode              1'h0
        31:1    R      RSVD                            31'h0
    */
    union
    {
        __IO uint32_t REG_KM4_RET_CFG_0;
        struct
        {
            __IO uint32_t km4_retention_mode: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_068;
    } u_068;

    /* 0x006C       0x4000_306c
        0       R/W    r_km4_dvfs_en                   1'h0
        31:1   R      RSVD                             31'h0
    */
    union
    {
        __IO uint32_t REG_KM4_DVFS_CTRL;
        struct
        {
            __IO uint32_t r_km4_dvfs_en: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_06C;
    } u_06C;

    /* 0x0070       0x4000_3070
        29:0    R      RSVD                            30'h0
        30      R/W    ppe_clk_always_disable          1'h0
        31      R/W    ppe_clk_always_enable           1'h1
    */
    union
    {
        __IO uint32_t REG_PPE_CTRL;
        struct
        {
            __I uint32_t RESERVED_0: 30;
            __IO uint32_t ppe_clk_always_disable: 1;
            __IO uint32_t ppe_clk_always_enable: 1;
        } BITS_070;
    } u_070;

    __IO uint32_t RSVD_0x74[3];

    /* 0x0080       0x4000_3080
        0       R/W    r_sys_32bits_timer_rst_sel      1'h1
        1       R/W    r_sys_32bits_timer_manual_rstb  1'h0
        31:2    R      RSVD                            30'h0
    */
    union
    {
        __IO uint32_t REG_KM4_SYS_CNT_CFG_0;
        struct
        {
            __IO uint32_t r_sys_32bits_timer_rst_sel: 1;
            __IO uint32_t r_sys_32bits_timer_manual_rstb: 1;
            __I uint32_t RESERVED_0: 30;
        } BITS_080;
    } u_080;

    /* 0x0084       0x4000_3084
        31:0    R      cpu_sys_32bits_timer_cnt        32'h0
    */
    union
    {
        __IO uint32_t REG_KM4_SYS_CNT_CFG_1;
        struct
        {
            __I uint32_t cpu_sys_32bits_timer_cnt: 32;
        } BITS_084;
    } u_084;

    /* 0x0088       0x4000_3088
        0       R/W    r_epalna_od                     1'b0
        31:1    R      RSVD                            31'h0
    */
    union
    {
        __IO uint32_t REG_TESTMODE_SEL_RF;
        struct
        {
            __IO uint32_t r_epalna_od: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_088;
    } u_088;

    __IO uint32_t RSVD_0x8c[1];

    /* 0x0090       0x4000_3090
        31:0    R/W    OUT_DATA0                       32'h0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_0;
        struct
        {
            __IO uint32_t OUT_DATA0: 32;
        } BITS_090;
    } u_090;

