rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
    /* 0x0094       0x4000_3094
        31:0    R/W    OUT_DATA1                       32'h0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_1;
        struct
        {
            __IO uint32_t OUT_DATA1: 32;
        } BITS_094;
    } u_094;

    /* 0x0098       0x4000_3098
        31:0    R      IN_DATA0                        32'h0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_2;
        struct
        {
            __I uint32_t IN_DATA0: 32;
        } BITS_098;
    } u_098;

    /* 0x009C       0x4000_309c
        31:0    R      IN_DATA1                        32'h0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_3;
        struct
        {
            __I uint32_t IN_DATA1: 32;
        } BITS_09C;
    } u_09C;

    /* 0x00A0       0x4000_30a0
        0       WAC    outbox_rdy_r                    1'h0
        1       R/W    out_empty_inten                 1'h0
        2       R/W    out_int_mode                    1'h0
        3       W1C    out_edge_sts                    1'h0
        4       R      rx_data_crc_ok                  1'h0
        15:5    R      RSVD                            11'h0
        16      W1C    inbox_rdy_r                     1'h0
        17      R/W    in_rdy_inten                    1'h0
        30:18   R      RSVD                            13'h0
        31      R/W    pta_i2c_en                      1'h0
    */
    union
    {
        __IO uint32_t REG_I2C_MAILBOX_4;
        struct
        {
            __IO uint32_t outbox_rdy_r: 1;
            __IO uint32_t out_empty_inten: 1;
            __IO uint32_t out_int_mode: 1;
            __IO uint32_t out_edge_sts: 1;
            __I uint32_t rx_data_crc_ok: 1;
            __I uint32_t RESERVED_1: 11;
            __IO uint32_t inbox_rdy_r: 1;
            __IO uint32_t in_rdy_inten: 1;
            __I uint32_t RESERVED_0: 13;
            __IO uint32_t pta_i2c_en: 1;
        } BITS_0A0;
    } u_0A0;

    __IO uint32_t RSVD_0xa4[5];

    /* 0x00B8       0x4000_30b8
        0       R/W    reg_fwpi_enable                 1'h1
        31:1    R      RSVD                            30'h0
    */
    union
    {
        __IO uint32_t REG_MODEMRFCPI_APB_WRAPPER;
        struct
        {
            __IO uint32_t reg_fwpi_enable: 1;
            __I uint32_t RESERVED_0: 31;
        } BITS_0B8;
    } u_0B8;

    __IO uint32_t RSVD_0xbc[1];

    /* 0x00C0       0x4000_30c0
        31:0    R/W    reg_enhtimer_0_latch_trig_0_sel 32'h0
    */
    union
    {
        __IO uint32_t REG_ENHTIMER_0_LATCH_TRIG_0_SEL;
        struct
        {
            __IO uint32_t reg_enhtimer_0_latch_trig_0_sel: 32;
        } BITS_0C0;
    } u_0C0;

    /* 0x00C4       0x4000_30c4
        31:0    R/W    reg_enhtimer_1_latch_trig_0_sel 32'h0
    */
    union
    {
        __IO uint32_t REG_ENHTIMER_1_LATCH_TRIG_0_SEL;
        struct
        {
            __IO uint32_t reg_enhtimer_1_latch_trig_0_sel: 32;
        } BITS_0C4;
    } u_0C4;

    /* 0x00C8       0x4000_30c8
        31:0    R/W    reg_enhtimer_2_latch_trig_0_sel 32'h0
    */
    union
    {
        __IO uint32_t REG_ENHTIMER_2_LATCH_TRIG_0_SEL;
        struct
        {
            __IO uint32_t reg_enhtimer_2_latch_trig_0_sel: 32;
        } BITS_0C8;
    } u_0C8;

    /* 0x00CC       0x4000_30cc
        31:0    R/W    reg_enhtimer_3_latch_trig_0_sel 32'h0
    */
    union
    {
        __IO uint32_t REG_ENHTIMER_3_LATCH_TRIG_0_SEL;
        struct
        {
            __IO uint32_t reg_enhtimer_3_latch_trig_0_sel: 32;
        } BITS_0CC;
    } u_0CC;

    /* 0x00D0       0x4000_30d0
        2:0     R/W    reg_bt_gpio_trig_sel            3'h0
        31:3    R/W    RSVD                            29'h0
    */
    union
    {
        __IO uint32_t REG_BT_GPIO_TRIG_ENHTIMER_CTRL;
        struct
        {
            __IO uint32_t reg_bt_gpio_trig_sel: 3;
            __IO uint32_t RESERVED_0: 29;
        } BITS_0D0;
    } u_0D0;

    /* 0x00D4       0x4000_30d4
        2:0     R/W    reg_bt_tx_on_trig_sel           3'h0
        31:3    R/W    RSVD                            29'h0
    */
    union
    {
        __IO uint32_t REG_BT_TX_ON_TRIG_ENHTIMER_CTRL;
        struct
        {
            __IO uint32_t reg_bt_tx_on_trig_sel: 3;
            __IO uint32_t RESERVED_0: 29;
        } BITS_0D4;
    } u_0D4;

    /* 0x00D8       0x4000_30d8
        2:0     R/W    reg_bt_acc_hit_trig_sel         3'h0
        31:3    R/W    RSVD                            29'h0
    */
    union
    {
        __IO uint32_t REG_BT_ACC_HIT_TRIG_ENHTIMER_CTRL;
        struct
        {
            __IO uint32_t reg_bt_acc_hit_trig_sel: 3;
            __IO uint32_t RESERVED_0: 29;
        } BITS_0D8;
    } u_0D8;

    __IO uint32_t RSVD_0xdc[5];

    /* 0x00F0       0x4000_30f0
        31:0    R/W    soc_vendor_dummy_reg_0          32'h0
    */
    union
    {
        __IO uint32_t REG_DUMMY_0;
        struct
        {
            __IO uint32_t soc_vendor_dummy_reg_0: 32;
        } BITS_0F0;
    } u_0F0;

    /* 0x00F4       0x4000_30f4
        31:0    R/W    soc_vendor_dummy_reg_1          32'h0
    */
    union
    {
        __IO uint32_t REG_DUMMY_1;
        struct
        {
            __IO uint32_t soc_vendor_dummy_reg_1: 32;
        } BITS_0F4;
    } u_0F4;

    /* 0x00F8       0x4000_30f8
        31:0    R/W    soc_vendor_dummy_reg_2          32'h0
    */
    union
    {
        __IO uint32_t REG_DUMMY_2;
        struct
        {
            __IO uint32_t soc_vendor_dummy_reg_2: 32;
        } BITS_0F8;
    } u_0F8;

    /* 0x00FC       0x4000_30fc
        31:0    R/W    soc_vendor_dummy_reg_3          32'h0
    */
    union
    {
        __IO uint32_t REG_DUMMY_3;
        struct
        {
            __IO uint32_t soc_vendor_dummy_reg_3: 32;
        } BITS_0FC;
    } u_0FC;

    /* 0x0100       0x4000_3100
        15:0    R/W    km4_wdt_wp                      16'h0
        31:16   R/W    RSVD                            16'h0
    */
    union
    {
        __IO uint32_t REG_KM4_WDT_WP;
        struct
        {
            __IO uint32_t km4_wdt_wp: 16;
            __IO uint32_t RESERVED_0: 16;
        } BITS_100;
    } u_100;

