rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
    /* 0x0104       0x4000_3104
        15:0    R/W    km4_wdt_clk_div_factor          16'hC80
        27:16   R/W    km4_wdt_cnt_limit               12'h64
        29:28   R/W    km4_wdt_mode                    2'h3
        30      R/W1C  km4_wdt_timeout_flag            1'h0
        31      R/W    km4_wdt_enable                  1'h0
    */
    union
    {
        __IO uint32_t REG_KM4_WDT_CONFIG;
        struct
        {
            __IO uint32_t km4_wdt_clk_div_factor: 16;
            __IO uint32_t km4_wdt_cnt_limit: 12;
            __IO uint32_t km4_wdt_mode: 2;
            __IO uint32_t km4_wdt_timeout_flag: 1;
            __IO uint32_t km4_wdt_enable: 1;
        } BITS_104;
    } u_104;

    /* 0x0108       0x4000_3108
        15:0    R/WAC  km4_wdt_cnt_reset               16'h0
        31:16   R/WAC  RSVD                            16'h0
    */
    union
    {
        __IO uint32_t REG_KM4_WDT_CNT_RESET;
        struct
        {
            __IO uint32_t km4_wdt_cnt_reset: 16;
            __IO uint32_t RESERVED_0: 16;
        } BITS_108;
    } u_108;

    /* 0x010C       0x4000_310c
        0       R/W    km4_wdt_wp_sec                  1'h0
        1       R/W    km4_wdt_config_sec              1'h0
        2       R/W    km4_wdt_cnt_reset_sec           1'h0
        31:3    R/W    RSVD                            29'h0
    */
    union
    {
        __IO uint32_t REG_KM4_WDT_SEC;
        struct
        {
            __IO uint32_t km4_wdt_wp_sec: 1;
            __IO uint32_t km4_wdt_config_sec: 1;
            __IO uint32_t km4_wdt_cnt_reset_sec: 1;
            __IO uint32_t RESERVED_0: 29;
        } BITS_10C;
    } u_10C;

    __IO uint32_t RSVD_0x110[60];

    /* 0x200        0x4000_3200
        0       R      bt_mac_1024x16_drf_start_pause  1'h0
        1       R      bt_mac_1024x16_drf_bist_fail    1'h0
        2       R      bt_mac_1024x16_drf_bist_done    1'h0
        3       R      bt_mac_1024x16_bist_fail        1'h0
        4       R      bt_mac_1024x16_bist_done        1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_1024x16_bist_grp_en      1'h0
        26      R/W    bt_mac_1024x16_dyn_read_en      1'h0
        27      R/W    bt_mac_1024x16_bist_loop_mode   1'h0
        28      R/W    bt_mac_1024x16_drf_test_resume  1'h0
        29      R/W    bt_mac_1024x16_drf_bist_mode    1'h0
        30      R/W    bt_mac_1024x16_bist_mode        1'h0
        31      R/W    bt_mac_1024x16_bist_rstn        1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x200;
        struct
        {
            __I uint32_t bt_mac_1024x16_drf_start_pause: 1;
            __I uint32_t bt_mac_1024x16_drf_bist_fail: 1;
            __I uint32_t bt_mac_1024x16_drf_bist_done: 1;
            __I uint32_t bt_mac_1024x16_bist_fail: 1;
            __I uint32_t bt_mac_1024x16_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_1024x16_bist_grp_en: 1;
            __IO uint32_t bt_mac_1024x16_dyn_read_en: 1;
            __IO uint32_t bt_mac_1024x16_bist_loop_mode: 1;
            __IO uint32_t bt_mac_1024x16_drf_test_resume: 1;
            __IO uint32_t bt_mac_1024x16_drf_bist_mode: 1;
            __IO uint32_t bt_mac_1024x16_bist_mode: 1;
            __IO uint32_t bt_mac_1024x16_bist_rstn: 1;
        } BITS_200;
    } u_200;

    /* 0x204        0x4000_3204
        0       R      bt_mac_512x16_drf_start_pause   1'h0
        1       R      bt_mac_512x16_drf_bist_fail     1'h0
        2       R      bt_mac_512x16_drf_bist_done     1'h0
        3       R      bt_mac_512x16_bist_fail         1'h0
        4       R      bt_mac_512x16_bist_done         1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_512x16_bist_grp_en       1'h0
        26      R/W    bt_mac_512x16_dyn_read_en       1'h0
        27      R/W    bt_mac_512x16_bist_loop_mode    1'h0
        28      R/W    bt_mac_512x16_drf_test_resume   1'h0
        29      R/W    bt_mac_512x16_drf_bist_mode     1'h0
        30      R/W    bt_mac_512x16_bist_mode         1'h0
        31      R/W    bt_mac_512x16_bist_rstn         1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x204;
        struct
        {
            __I uint32_t bt_mac_512x16_drf_start_pause: 1;
            __I uint32_t bt_mac_512x16_drf_bist_fail: 1;
            __I uint32_t bt_mac_512x16_drf_bist_done: 1;
            __I uint32_t bt_mac_512x16_bist_fail: 1;
            __I uint32_t bt_mac_512x16_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_512x16_bist_grp_en: 1;
            __IO uint32_t bt_mac_512x16_dyn_read_en: 1;
            __IO uint32_t bt_mac_512x16_bist_loop_mode: 1;
            __IO uint32_t bt_mac_512x16_drf_test_resume: 1;
            __IO uint32_t bt_mac_512x16_drf_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_bist_mode: 1;
            __IO uint32_t bt_mac_512x16_bist_rstn: 1;
        } BITS_204;
    } u_204;

    /* 0x208        0x4000_3208
        0       R      bt_mac_128x32_0_drf_start_pause 1'h0
        1       R      bt_mac_128x32_0_drf_bist_fail   1'h0
        2       R      bt_mac_128x32_0_drf_bist_done   1'h0
        3       R      bt_mac_128x32_0_bist_fail       1'h0
        4       R      bt_mac_128x32_0_bist_done       1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_128x32_0_bist_grp_en     1'h0
        26      R/W    bt_mac_128x32_0_dyn_read_en     1'h0
        27      R/W    bt_mac_128x32_0_bist_loop_mode  1'h0
        28      R/W    bt_mac_128x32_0_drf_test_resume 1'h0
        29      R/W    bt_mac_128x32_0_drf_bist_mode   1'h0
        30      R/W    bt_mac_128x32_0_bist_mode       1'h0
        31      R/W    bt_mac_128x32_0_bist_rstn       1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x208;
        struct
        {
            __I uint32_t bt_mac_128x32_0_drf_start_pause: 1;
            __I uint32_t bt_mac_128x32_0_drf_bist_fail: 1;
            __I uint32_t bt_mac_128x32_0_drf_bist_done: 1;
            __I uint32_t bt_mac_128x32_0_bist_fail: 1;
            __I uint32_t bt_mac_128x32_0_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_128x32_0_bist_grp_en: 1;
            __IO uint32_t bt_mac_128x32_0_dyn_read_en: 1;
            __IO uint32_t bt_mac_128x32_0_bist_loop_mode: 1;
            __IO uint32_t bt_mac_128x32_0_drf_test_resume: 1;
            __IO uint32_t bt_mac_128x32_0_drf_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_0_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_0_bist_rstn: 1;
        } BITS_208;
    } u_208;

    /* 0x20C        0x4000_320c
        0       R      bt_mac_128x32_1_drf_start_pause 1'h0
        1       R      bt_mac_128x32_1_drf_bist_fail   1'h0
        2       R      bt_mac_128x32_1_drf_bist_done   1'h0
        3       R      bt_mac_128x32_1_bist_fail       1'h0
        4       R      bt_mac_128x32_1_bist_done       1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_128x32_1_bist_grp_en     1'h0
        26      R/W    bt_mac_128x32_1_dyn_read_en     1'h0
        27      R/W    bt_mac_128x32_1_bist_loop_mode  1'h0
        28      R/W    bt_mac_128x32_1_drf_test_resume 1'h0
        29      R/W    bt_mac_128x32_1_drf_bist_mode   1'h0
        30      R/W    bt_mac_128x32_1_bist_mode       1'h0
        31      R/W    bt_mac_128x32_1_bist_rstn       1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x20C;
        struct
        {
            __I uint32_t bt_mac_128x32_1_drf_start_pause: 1;
            __I uint32_t bt_mac_128x32_1_drf_bist_fail: 1;
            __I uint32_t bt_mac_128x32_1_drf_bist_done: 1;
            __I uint32_t bt_mac_128x32_1_bist_fail: 1;
            __I uint32_t bt_mac_128x32_1_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_128x32_1_bist_grp_en: 1;
            __IO uint32_t bt_mac_128x32_1_dyn_read_en: 1;
            __IO uint32_t bt_mac_128x32_1_bist_loop_mode: 1;
            __IO uint32_t bt_mac_128x32_1_drf_test_resume: 1;
            __IO uint32_t bt_mac_128x32_1_drf_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_1_bist_mode: 1;
            __IO uint32_t bt_mac_128x32_1_bist_rstn: 1;
        } BITS_20C;
    } u_20C;

    /* 0x210        0x4000_3210
        0       R      bt_mac_640x32_drf_start_pause   1'h0
        1       R      bt_mac_640x32_drf_bist_fail     1'h0
        2       R      bt_mac_640x32_drf_bist_done     1'h0
        3       R      bt_mac_640x32_bist_fail         1'h0
        4       R      bt_mac_640x32_bist_done         1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_640x32_bist_grp_en       1'h0
        26      R/W    bt_mac_640x32_dyn_read_en       1'h0
        27      R/W    bt_mac_640x32_bist_loop_mode    1'h0
        28      R/W    bt_mac_640x32_drf_test_resume   1'h0
        29      R/W    bt_mac_640x32_drf_bist_mode     1'h0
        30      R/W    bt_mac_640x32_bist_mode         1'h0
        31      R/W    bt_mac_640x32_bist_rstn         1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x210;
        struct
        {
            __I uint32_t bt_mac_640x32_drf_start_pause: 1;
            __I uint32_t bt_mac_640x32_drf_bist_fail: 1;
            __I uint32_t bt_mac_640x32_drf_bist_done: 1;
            __I uint32_t bt_mac_640x32_bist_fail: 1;
            __I uint32_t bt_mac_640x32_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_640x32_bist_grp_en: 1;
            __IO uint32_t bt_mac_640x32_dyn_read_en: 1;
            __IO uint32_t bt_mac_640x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_640x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_640x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_640x32_bist_mode: 1;
            __IO uint32_t bt_mac_640x32_bist_rstn: 1;
        } BITS_210;
    } u_210;

    /* 0x214        0x4000_3214
        0       R      bt_mac_96x32_drf_start_pause    1'h0
        1       R      bt_mac_96x32_drf_bist_fail      1'h0
        2       R      bt_mac_96x32_drf_bist_done      1'h0
        3       R      bt_mac_96x32_bist_fail          1'h0
        4       R      bt_mac_96x32_bist_done          1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_96x32_bist_grp_en        1'h0
        26      R/W    bt_mac_96x32_dyn_read_en        1'h0
        27      R/W    bt_mac_96x32_bist_loop_mode     1'h0
        28      R/W    bt_mac_96x32_drf_test_resume    1'h0
        29      R/W    bt_mac_96x32_drf_bist_mode      1'h0
        30      R/W    bt_mac_96x32_bist_mode          1'h0
        31      R/W    bt_mac_96x32_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x214;
        struct
        {
            __I uint32_t bt_mac_96x32_drf_start_pause: 1;
            __I uint32_t bt_mac_96x32_drf_bist_fail: 1;
            __I uint32_t bt_mac_96x32_drf_bist_done: 1;
            __I uint32_t bt_mac_96x32_bist_fail: 1;
            __I uint32_t bt_mac_96x32_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_96x32_bist_grp_en: 1;
            __IO uint32_t bt_mac_96x32_dyn_read_en: 1;
            __IO uint32_t bt_mac_96x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_96x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_96x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_96x32_bist_mode: 1;
            __IO uint32_t bt_mac_96x32_bist_rstn: 1;
        } BITS_214;
    } u_214;

    /* 0x218        0x4000_3218
        0       R      bt_mac_64x32_drf_start_pause    1'h0
        1       R      bt_mac_64x32_drf_bist_fail      1'h0
        2       R      bt_mac_64x32_drf_bist_done      1'h0
        3       R      bt_mac_64x32_bist_fail          1'h0
        4       R      bt_mac_64x32_bist_done          1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    bt_mac_64x32_bist_grp_en        1'h0
        26      R/W    bt_mac_64x32_dyn_read_en        1'h0
        27      R/W    bt_mac_64x32_bist_loop_mode     1'h0
        28      R/W    bt_mac_64x32_drf_test_resume    1'h0
        29      R/W    bt_mac_64x32_drf_bist_mode      1'h0
        30      R/W    bt_mac_64x32_bist_mode          1'h0
        31      R/W    bt_mac_64x32_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x218;
        struct
        {
            __I uint32_t bt_mac_64x32_drf_start_pause: 1;
            __I uint32_t bt_mac_64x32_drf_bist_fail: 1;
            __I uint32_t bt_mac_64x32_drf_bist_done: 1;
            __I uint32_t bt_mac_64x32_bist_fail: 1;
            __I uint32_t bt_mac_64x32_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t bt_mac_64x32_bist_grp_en: 1;
            __IO uint32_t bt_mac_64x32_dyn_read_en: 1;
            __IO uint32_t bt_mac_64x32_bist_loop_mode: 1;
            __IO uint32_t bt_mac_64x32_drf_test_resume: 1;
            __IO uint32_t bt_mac_64x32_drf_bist_mode: 1;
            __IO uint32_t bt_mac_64x32_bist_mode: 1;
            __IO uint32_t bt_mac_64x32_bist_rstn: 1;
        } BITS_218;
    } u_218;

    /* 0x21C        0x4000_321c
        0       R      zb_mac_16x32_drf_start_pause    1'h0
        1       R      zb_mac_16x32_drf_bist_fail      1'h0
        2       R      zb_mac_16x32_drf_bist_done      1'h0
        3       R      zb_mac_16x32_bist_fail          1'h0
        4       R      zb_mac_16x32_bist_done          1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    zb_mac_16x32_bist_grp_en        1'h0
        26      R/W    zb_mac_16x32_dyn_read_en        1'h0
        27      R/W    zb_mac_16x32_bist_loop_mode     1'h0
        28      R/W    zb_mac_16x32_drf_test_resume    1'h0
        29      R/W    zb_mac_16x32_drf_bist_mode      1'h0
        30      R/W    zb_mac_16x32_bist_mode          1'h0
        31      R/W    zb_mac_16x32_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x21C;
        struct
        {
            __I uint32_t zb_mac_16x32_drf_start_pause: 1;
            __I uint32_t zb_mac_16x32_drf_bist_fail: 1;
            __I uint32_t zb_mac_16x32_drf_bist_done: 1;
            __I uint32_t zb_mac_16x32_bist_fail: 1;
            __I uint32_t zb_mac_16x32_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t zb_mac_16x32_bist_grp_en: 1;
            __IO uint32_t zb_mac_16x32_dyn_read_en: 1;
            __IO uint32_t zb_mac_16x32_bist_loop_mode: 1;
            __IO uint32_t zb_mac_16x32_drf_test_resume: 1;
            __IO uint32_t zb_mac_16x32_drf_bist_mode: 1;
            __IO uint32_t zb_mac_16x32_bist_mode: 1;
            __IO uint32_t zb_mac_16x32_bist_rstn: 1;
        } BITS_21C;
    } u_21C;

    /* 0x220        0x4000_3220
        0       R      zb_mac_40x32_drf_start_pause    1'h0
        2:1     R      zb_mac_40x32_drf_bist_fail      2'h0
        3       R      zb_mac_40x32_drf_bist_done      1'h0
        5:4     R      zb_mac_40x32_bist_fail          2'h0
        6       R      zb_mac_40x32_bist_done          1'h0
        23:7    R      RSVD                            17'h0
        25:24   R/W    zb_mac_40x32_bist_grp_en        2'h0
        26      R/W    zb_mac_40x32_dyn_read_en        1'h0
        27      R/W    zb_mac_40x32_bist_loop_mode     1'h0
        28      R/W    zb_mac_40x32_drf_test_resume    1'h0
        29      R/W    zb_mac_40x32_drf_bist_mode      1'h0
        30      R/W    zb_mac_40x32_bist_mode          1'h0
        31      R/W    zb_mac_40x32_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x220;
        struct
        {
            __I uint32_t zb_mac_40x32_drf_start_pause: 1;
            __I uint32_t zb_mac_40x32_drf_bist_fail: 2;
            __I uint32_t zb_mac_40x32_drf_bist_done: 1;
            __I uint32_t zb_mac_40x32_bist_fail: 2;
            __I uint32_t zb_mac_40x32_bist_done: 1;
            __I uint32_t RESERVED_0: 17;
            __IO uint32_t zb_mac_40x32_bist_grp_en: 2;
            __IO uint32_t zb_mac_40x32_dyn_read_en: 1;
            __IO uint32_t zb_mac_40x32_bist_loop_mode: 1;
            __IO uint32_t zb_mac_40x32_drf_test_resume: 1;
            __IO uint32_t zb_mac_40x32_drf_bist_mode: 1;
            __IO uint32_t zb_mac_40x32_bist_mode: 1;
            __IO uint32_t zb_mac_40x32_bist_rstn: 1;
        } BITS_220;
    } u_220;

    /* 0x224        0x4000_3224
        0       R      zb_mac_32x32_drf_start_pause    1'h0
        4:1     R      zb_mac_32x32_drf_bist_fail      4'h0
        5       R      zb_mac_32x32_drf_bist_done      1'h0
        9:6     R      zb_mac_32x32_bist_fail          4'h0
        10      R      zb_mac_32x32_bist_done          1'h0
        21:11   R      RSVD                            11'h0
        25:22   R/W    zb_mac_32x32_bist_grp_en        4'h0
        26      R/W    zb_mac_32x32_dyn_read_en        1'h0
        27      R/W    zb_mac_32x32_bist_loop_mode     1'h0
        28      R/W    zb_mac_32x32_drf_test_resume    1'h0
        29      R/W    zb_mac_32x32_drf_bist_mode      1'h0
        30      R/W    zb_mac_32x32_bist_mode          1'h0
        31      R/W    zb_mac_32x32_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x224;
        struct
        {
            __I uint32_t zb_mac_32x32_drf_start_pause: 1;
            __I uint32_t zb_mac_32x32_drf_bist_fail: 4;
            __I uint32_t zb_mac_32x32_drf_bist_done: 1;
            __I uint32_t zb_mac_32x32_bist_fail: 4;
            __I uint32_t zb_mac_32x32_bist_done: 1;
            __I uint32_t RESERVED_0: 11;
            __IO uint32_t zb_mac_32x32_bist_grp_en: 4;
            __IO uint32_t zb_mac_32x32_dyn_read_en: 1;
            __IO uint32_t zb_mac_32x32_bist_loop_mode: 1;
            __IO uint32_t zb_mac_32x32_drf_test_resume: 1;
            __IO uint32_t zb_mac_32x32_drf_bist_mode: 1;
            __IO uint32_t zb_mac_32x32_bist_mode: 1;
            __IO uint32_t zb_mac_32x32_bist_rstn: 1;
        } BITS_224;
    } u_224;

    /* 0x228        0x4000_3228
        0       R      btphy_128x12x4_drf_start_pause  1'h0
        4:1     R      btphy_128x12x4_drf_bist_fail    4'h0
        5       R      btphy_128x12x4_drf_bist_done    1'h0
        9:6     R      btphy_128x12x4_bist_fail        4'h0
        10      R      btphy_128x12x4_bist_done        1'h0
        21:11   R      RSVD                            11'h0
        25:22   R/W    btphy_128x12x4_bist_grp_en      4'h0
        26      R/W    btphy_128x12x4_dyn_read_en      1'h0
        27      R/W    btphy_128x12x4_bist_loop_mode   1'h0
        28      R/W    btphy_128x12x4_drf_test_resume  1'h0
        29      R/W    btphy_128x12x4_drf_bist_mode    1'h0
        30      R/W    btphy_128x12x4_bist_mode        1'h0
        31      R/W    btphy_128x12x4_bist_rstn        1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x228;
        struct
        {
            __I uint32_t btphy_128x12x4_drf_start_pause: 1;
            __I uint32_t btphy_128x12x4_drf_bist_fail: 4;
            __I uint32_t btphy_128x12x4_drf_bist_done: 1;
            __I uint32_t btphy_128x12x4_bist_fail: 4;
            __I uint32_t btphy_128x12x4_bist_done: 1;
            __I uint32_t RESERVED_0: 11;
            __IO uint32_t btphy_128x12x4_bist_grp_en: 4;
            __IO uint32_t btphy_128x12x4_dyn_read_en: 1;
            __IO uint32_t btphy_128x12x4_bist_loop_mode: 1;
            __IO uint32_t btphy_128x12x4_drf_test_resume: 1;
            __IO uint32_t btphy_128x12x4_drf_bist_mode: 1;
            __IO uint32_t btphy_128x12x4_bist_mode: 1;
            __IO uint32_t btphy_128x12x4_bist_rstn: 1;
        } BITS_228;
    } u_228;

    /* 0x22C        0x4000_322c
        0       R      btphy_lr_ram_drf_start_pause    1'h0
        5:1     R      btphy_lr_ram_drf_bist_fail      5'h0
        6       R      btphy_lr_ram_drf_bist_done      1'h0
        11:7    R      btphy_lr_ram_bist_fail          5'h0
        12      R      btphy_lr_ram_bist_done          1'h0
        20:13   R      RSVD                            8'h0
        25:21   R/W    btphy_lr_ram_bist_grp_en        5'h0
        26      R/W    btphy_lr_ram_dyn_read_en        1'h0
        27      R/W    btphy_lr_ram_bist_loop_mode     1'h0
        28      R/W    btphy_lr_ram_drf_test_resume    1'h0
        29      R/W    btphy_lr_ram_drf_bist_mode      1'h0
        30      R/W    btphy_lr_ram_bist_mode          1'h0
        31      R/W    btphy_lr_ram_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x22C;
        struct
        {
            __I uint32_t btphy_lr_ram_drf_start_pause: 1;
            __I uint32_t btphy_lr_ram_drf_bist_fail: 5;
            __I uint32_t btphy_lr_ram_drf_bist_done: 1;
            __I uint32_t btphy_lr_ram_bist_fail: 5;
            __I uint32_t btphy_lr_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 8;
            __IO uint32_t btphy_lr_ram_bist_grp_en: 5;
            __IO uint32_t btphy_lr_ram_dyn_read_en: 1;
            __IO uint32_t btphy_lr_ram_bist_loop_mode: 1;
            __IO uint32_t btphy_lr_ram_drf_test_resume: 1;
            __IO uint32_t btphy_lr_ram_drf_bist_mode: 1;
            __IO uint32_t btphy_lr_ram_bist_mode: 1;
            __IO uint32_t btphy_lr_ram_bist_rstn: 1;
        } BITS_22C;
    } u_22C;

    /* 0x230        0x4000_3230
        0       R      km4_itcm0_bist_done             1'h0
        25:1    R      RSVD                            25'h0
        29:26   R/W    km4_itcm0_bist_grp_en           4'h0
        30      R/W    km4_itcm0_bist_mode             1'h0
        31      R/W    km4_itcm0_bist_rstn             1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x230;
        struct
        {
            __I uint32_t km4_itcm0_bist_done: 1;
            __I uint32_t RESERVED_0: 25;
            __IO uint32_t km4_itcm0_bist_grp_en: 4;
            __IO uint32_t km4_itcm0_bist_mode: 1;
            __IO uint32_t km4_itcm0_bist_rstn: 1;
        } BITS_230;
    } u_230;

    /* 0x234        0x4000_3234
        31:0    R      km4_itcm0_misr_dataout_0_31_00  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x234;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_0_31_00: 32;
        } BITS_234;
    } u_234;

    /* 0x238        0x4000_3238
        31:0    R      km4_itcm0_misr_dataout_0_63_32  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x238;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_0_63_32: 32;
        } BITS_238;
    } u_238;

    /* 0x23C        0x4000_323c
        31:0    R      km4_itcm0_misr_dataout_1_31_00  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x23C;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_1_31_00: 32;
        } BITS_23C;
    } u_23C;

    /* 0x240        0x4000_3240
        31:0    R      km4_itcm0_misr_dataout_1_63_32  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x240;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_1_63_32: 32;
        } BITS_240;
    } u_240;

    /* 0x244        0x4000_3244
        31:0    R      km4_itcm0_misr_dataout_2_31_00  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x244;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_2_31_00: 32;
        } BITS_244;
    } u_244;

    /* 0x248        0x4000_3248
        31:0    R      km4_itcm0_misr_dataout_2_63_32  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x248;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_2_63_32: 32;
        } BITS_248;
    } u_248;

