rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
    /* 0x24C        0x4000_324c
        31:0    R      km4_itcm0_misr_dataout_3_31_00  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x24C;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_3_31_00: 32;
        } BITS_24C;
    } u_24C;

    /* 0x250        0x4000_3250
        31:0    R      km4_itcm0_misr_dataout_3_63_32  32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x250;
        struct
        {
            __I uint32_t km4_itcm0_misr_dataout_3_63_32: 32;
        } BITS_250;
    } u_250;

    /* 0x254        0x4000_3254
        13:0    R      RSVD                            14'h0
        25:14   R/W    km4_itcm1_bist_grp_en           12'h0
        26      R/W    km4_itcm1_dyn_read_en           1'h0
        27      R/W    km4_itcm1_bist_loop_mode        1'h0
        28      R/W    km4_itcm1_drf_test_resume       1'h0
        29      R/W    km4_itcm1_drf_bist_mode         1'h0
        30      R/W    km4_itcm1_bist_mode             1'h0
        31      R/W    km4_itcm1_bist_rstn             1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x254;
        struct
        {
            __I uint32_t RESERVED_0: 14;
            __IO uint32_t km4_itcm1_bist_grp_en: 12;
            __IO uint32_t km4_itcm1_dyn_read_en: 1;
            __IO uint32_t km4_itcm1_bist_loop_mode: 1;
            __IO uint32_t km4_itcm1_drf_test_resume: 1;
            __IO uint32_t km4_itcm1_drf_bist_mode: 1;
            __IO uint32_t km4_itcm1_bist_mode: 1;
            __IO uint32_t km4_itcm1_bist_rstn: 1;
        } BITS_254;
    } u_254;

    /* 0x258        0x4000_3258
        0       R      km4_itcm1_drf_start_pause       1'h0
        12:1    R      km4_itcm1_drf_bist_fail         12'h0
        13      R      km4_itcm1_drf_bist_done         1'h0
        25:14   R      km4_itcm1_bist_fail             12'h0
        26      R      km4_itcm1_bist_done             1'h0
        31:27   R      RSVD                            5'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x258;
        struct
        {
            __I uint32_t km4_itcm1_drf_start_pause: 1;
            __I uint32_t km4_itcm1_drf_bist_fail: 12;
            __I uint32_t km4_itcm1_drf_bist_done: 1;
            __I uint32_t km4_itcm1_bist_fail: 12;
            __I uint32_t km4_itcm1_bist_done: 1;
            __I uint32_t RESERVED_0: 5;
        } BITS_258;
    } u_258;

    /* 0x25C        0x4000_325c
        0       R      km4_dtcm0_drf_start_pause       1'h0
        4:1     R      km4_dtcm0_drf_bist_fail         4'h0
        5       R      km4_dtcm0_drf_bist_done         1'h0
        9:6     R      km4_dtcm0_bist_fail             4'h0
        10      R      km4_dtcm0_bist_done             1'h0
        21:11   R      RSVD                            11'h0
        25:22   R/W    km4_dtcm0_bist_grp_en           4'h0
        26      R/W    km4_dtcm0_dyn_read_en           1'h0
        27      R/W    km4_dtcm0_bist_loop_mode        1'h0
        28      R/W    km4_dtcm0_drf_test_resume       1'h0
        29      R/W    km4_dtcm0_drf_bist_mode         1'h0
        30      R/W    km4_dtcm0_bist_mode             1'h0
        31      R/W    km4_dtcm0_bist_rstn             1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x25C;
        struct
        {
            __I uint32_t km4_dtcm0_drf_start_pause: 1;
            __I uint32_t km4_dtcm0_drf_bist_fail: 4;
            __I uint32_t km4_dtcm0_drf_bist_done: 1;
            __I uint32_t km4_dtcm0_bist_fail: 4;
            __I uint32_t km4_dtcm0_bist_done: 1;
            __I uint32_t RESERVED_0: 11;
            __IO uint32_t km4_dtcm0_bist_grp_en: 4;
            __IO uint32_t km4_dtcm0_dyn_read_en: 1;
            __IO uint32_t km4_dtcm0_bist_loop_mode: 1;
            __IO uint32_t km4_dtcm0_drf_test_resume: 1;
            __IO uint32_t km4_dtcm0_drf_bist_mode: 1;
            __IO uint32_t km4_dtcm0_bist_mode: 1;
            __IO uint32_t km4_dtcm0_bist_rstn: 1;
        } BITS_25C;
    } u_25C;

    /* 0x260        0x4000_3260
        0       R      km4_dtcm1_drf_start_pause       1'h0
        4:1     R      km4_dtcm1_drf_bist_fail         4'h0
        5       R      km4_dtcm1_drf_bist_done         1'h0
        9:6     R      km4_dtcm1_bist_fail             4'h0
        10      R      km4_dtcm1_bist_done             1'h0
        21:11   R      RSVD                            11'h0
        25:22   R/W    km4_dtcm1_bist_grp_en           4'h0
        26      R/W    km4_dtcm1_dyn_read_en           1'h0
        27      R/W    km4_dtcm1_bist_loop_mode        1'h0
        28      R/W    km4_dtcm1_drf_test_resume       1'h0
        29      R/W    km4_dtcm1_drf_bist_mode         1'h0
        30      R/W    km4_dtcm1_bist_mode             1'h0
        31      R/W    km4_dtcm1_bist_rstn             1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x260;
        struct
        {
            __I uint32_t km4_dtcm1_drf_start_pause: 1;
            __I uint32_t km4_dtcm1_drf_bist_fail: 4;
            __I uint32_t km4_dtcm1_drf_bist_done: 1;
            __I uint32_t km4_dtcm1_bist_fail: 4;
            __I uint32_t km4_dtcm1_bist_done: 1;
            __I uint32_t RESERVED_0: 11;
            __IO uint32_t km4_dtcm1_bist_grp_en: 4;
            __IO uint32_t km4_dtcm1_dyn_read_en: 1;
            __IO uint32_t km4_dtcm1_bist_loop_mode: 1;
            __IO uint32_t km4_dtcm1_drf_test_resume: 1;
            __IO uint32_t km4_dtcm1_drf_bist_mode: 1;
            __IO uint32_t km4_dtcm1_bist_mode: 1;
            __IO uint32_t km4_dtcm1_bist_rstn: 1;
        } BITS_260;
    } u_260;

    /* 0x264        0x4000_3264
        15:0    R      RSVD                            16'h0
        25:16   R/W    km4_cache_bist_grp_en           10'h0
        26      R/W    km4_cache_dyn_read_en           1'h0
        27      R/W    km4_cache_bist_loop_mode        1'h0
        28      R/W    km4_cache_drf_test_resume       1'h0
        29      R/W    km4_cache_drf_bist_mode         1'h0
        30      R/W    km4_cache_bist_mode             1'h0
        31      R/W    km4_cache_bist_rstn             1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x264;
        struct
        {
            __I uint32_t RESERVED_0: 16;
            __IO uint32_t km4_cache_bist_grp_en: 10;
            __IO uint32_t km4_cache_dyn_read_en: 1;
            __IO uint32_t km4_cache_bist_loop_mode: 1;
            __IO uint32_t km4_cache_drf_test_resume: 1;
            __IO uint32_t km4_cache_drf_bist_mode: 1;
            __IO uint32_t km4_cache_bist_mode: 1;
            __IO uint32_t km4_cache_bist_rstn: 1;
        } BITS_264;
    } u_264;

    /* 0x268        0x4000_3268
        0       R      km4_cache_drf_start_pause       1'h0
        10:1    R      km4_cache_drf_bist_fail         10'h0
        11      R      km4_cache_drf_bist_done         1'h0
        21:12   R      km4_cache_bist_fail             10'h0
        22      R      km4_cache_bist_done             1'h0
        31:23   R      RSVD                            9'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x268;
        struct
        {
            __I uint32_t km4_cache_drf_start_pause: 1;
            __I uint32_t km4_cache_drf_bist_fail: 10;
            __I uint32_t km4_cache_drf_bist_done: 1;
            __I uint32_t km4_cache_bist_fail: 10;
            __I uint32_t km4_cache_bist_done: 1;
            __I uint32_t RESERVED_0: 9;
        } BITS_268;
    } u_268;

    /* 0x26C        0x4000_326c
        0       R      buffer_ram_drf_start_pause      1'h0
        3:1     R      buffer_ram_drf_bist_fail        3'h0
        4       R      buffer_ram_drf_bist_done        1'h0
        7:5     R      buffer_ram_bist_fail            3'h0
        8       R      buffer_ram_bist_done            1'h0
        22:9    R      RSVD                            14'h0
        25:23   R/W    buffer_ram_bist_grp_en          3'h0
        26      R/W    buffer_ram_dyn_read_en          1'h0
        27      R/W    buffer_ram_bist_loop_mode       1'h0
        28      R/W    buffer_ram_drf_test_resume      1'h0
        29      R/W    buffer_ram_drf_bist_mode        1'h0
        30      R/W    buffer_ram_bist_mode            1'h0
        31      R/W    buffer_ram_bist_rstn            1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x26C;
        struct
        {
            __I uint32_t buffer_ram_drf_start_pause: 1;
            __I uint32_t buffer_ram_drf_bist_fail: 3;
            __I uint32_t buffer_ram_drf_bist_done: 1;
            __I uint32_t buffer_ram_bist_fail: 3;
            __I uint32_t buffer_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 14;
            __IO uint32_t buffer_ram_bist_grp_en: 3;
            __IO uint32_t buffer_ram_dyn_read_en: 1;
            __IO uint32_t buffer_ram_bist_loop_mode: 1;
            __IO uint32_t buffer_ram_drf_test_resume: 1;
            __IO uint32_t buffer_ram_drf_bist_mode: 1;
            __IO uint32_t buffer_ram_bist_mode: 1;
            __IO uint32_t buffer_ram_bist_rstn: 1;
        } BITS_26C;
    } u_26C;

    /* 0x270        0x4000_3270
        0       R      data_ram_drf_start_pause        1'h0
        1       R      data_ram_drf_bist_fail          1'h0
        2       R      data_ram_drf_bist_done          1'h0
        3       R      data_ram_bist_fail              1'h0
        4       R      data_ram_bist_done              1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    data_ram_bist_grp_en            1'h0
        26      R/W    data_ram_dyn_read_en            1'h0
        27      R/W    data_ram_bist_loop_mode         1'h0
        28      R/W    data_ram_drf_test_resume        1'h0
        29      R/W    data_ram_drf_bist_mode          1'h0
        30      R/W    data_ram_bist_mode              1'h0
        31      R/W    data_ram_bist_rstn              1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x270;
        struct
        {
            __I uint32_t data_ram_drf_start_pause: 1;
            __I uint32_t data_ram_drf_bist_fail: 1;
            __I uint32_t data_ram_drf_bist_done: 1;
            __I uint32_t data_ram_bist_fail: 1;
            __I uint32_t data_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t data_ram_bist_grp_en: 1;
            __IO uint32_t data_ram_dyn_read_en: 1;
            __IO uint32_t data_ram_bist_loop_mode: 1;
            __IO uint32_t data_ram_drf_test_resume: 1;
            __IO uint32_t data_ram_drf_bist_mode: 1;
            __IO uint32_t data_ram_bist_mode: 1;
            __IO uint32_t data_ram_bist_rstn: 1;
        } BITS_270;
    } u_270;

    /* 0x274        0x4000_3274
        0       R      usb_2176x35_drf_start_pause     1'h0
        1       R      usb_2176x35_drf_bist_fail       1'h0
        2       R      usb_2176x35_drf_bist_done       1'h0
        3       R      usb_2176x35_bist_fail           1'h0
        4       R      usb_2176x35_bist_done           1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    usb_2176x35_bist_grp_en         1'h0
        26      R/W    usb_2176x35_dyn_read_en         1'h0
        27      R/W    usb_2176x35_bist_loop_mode      1'h0
        28      R/W    usb_2176x35_drf_test_resume     1'h0
        29      R/W    usb_2176x35_drf_bist_mode       1'h0
        30      R/W    usb_2176x35_bist_mode           1'h0
        31      R/W    usb_2176x35_bist_rstn           1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x274;
        struct
        {
            __I uint32_t usb_2176x35_drf_start_pause: 1;
            __I uint32_t usb_2176x35_drf_bist_fail: 1;
            __I uint32_t usb_2176x35_drf_bist_done: 1;
            __I uint32_t usb_2176x35_bist_fail: 1;
            __I uint32_t usb_2176x35_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t usb_2176x35_bist_grp_en: 1;
            __IO uint32_t usb_2176x35_dyn_read_en: 1;
            __IO uint32_t usb_2176x35_bist_loop_mode: 1;
            __IO uint32_t usb_2176x35_drf_test_resume: 1;
            __IO uint32_t usb_2176x35_drf_bist_mode: 1;
            __IO uint32_t usb_2176x35_bist_mode: 1;
            __IO uint32_t usb_2176x35_bist_rstn: 1;
        } BITS_274;
    } u_274;

    /* 0x278        0x4000_3278
        0       R      sdio_ram_drf_start_pause        1'h0
        1       R      sdio_ram_drf_bist_fail          1'h0
        2       R      sdio_ram_drf_bist_done          1'h0
        3       R      sdio_ram_bist_fail              1'h0
        4       R      sdio_ram_bist_done              1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    sdio_ram_bist_grp_en            1'h0
        26      R/W    sdio_ram_dyn_read_en            1'h0
        27      R/W    sdio_ram_bist_loop_mode         1'h0
        28      R/W    sdio_ram_drf_test_resume        1'h0
        29      R/W    sdio_ram_drf_bist_mode          1'h0
        30      R/W    sdio_ram_bist_mode              1'h0
        31      R/W    sdio_ram_bist_rstn              1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x278;
        struct
        {
            __I uint32_t sdio_ram_drf_start_pause: 1;
            __I uint32_t sdio_ram_drf_bist_fail: 1;
            __I uint32_t sdio_ram_drf_bist_done: 1;
            __I uint32_t sdio_ram_bist_fail: 1;
            __I uint32_t sdio_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t sdio_ram_bist_grp_en: 1;
            __IO uint32_t sdio_ram_dyn_read_en: 1;
            __IO uint32_t sdio_ram_bist_loop_mode: 1;
            __IO uint32_t sdio_ram_drf_test_resume: 1;
            __IO uint32_t sdio_ram_drf_bist_mode: 1;
            __IO uint32_t sdio_ram_bist_mode: 1;
            __IO uint32_t sdio_ram_bist_rstn: 1;
        } BITS_278;
    } u_278;

    /* 0x27C        0x4000_327c
        0       R      display_128x32_drf_start_pause  1'h0
        1       R      display_128x32_drf_bist_fail    1'h0
        2       R      display_128x32_drf_bist_done    1'h0
        3       R      display_128x32_bist_fail        1'h0
        4       R      display_128x32_bist_done        1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    display_128x32_bist_grp_en      1'h0
        26      R/W    display_128x32_dyn_read_en      1'h0
        27      R/W    display_128x32_bist_loop_mode   1'h0
        28      R/W    display_128x32_drf_test_resume  1'h0
        29      R/W    display_128x32_drf_bist_mode    1'h0
        30      R/W    display_128x32_bist_mode        1'h0
        31      R/W    display_128x32_bist_rstn        1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x27C;
        struct
        {
            __I uint32_t display_128x32_drf_start_pause: 1;
            __I uint32_t display_128x32_drf_bist_fail: 1;
            __I uint32_t display_128x32_drf_bist_done: 1;
            __I uint32_t display_128x32_bist_fail: 1;
            __I uint32_t display_128x32_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t display_128x32_bist_grp_en: 1;
            __IO uint32_t display_128x32_dyn_read_en: 1;
            __IO uint32_t display_128x32_bist_loop_mode: 1;
            __IO uint32_t display_128x32_drf_test_resume: 1;
            __IO uint32_t display_128x32_drf_bist_mode: 1;
            __IO uint32_t display_128x32_bist_mode: 1;
            __IO uint32_t display_128x32_bist_rstn: 1;
        } BITS_27C;
    } u_27C;

