rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
    /* 0x280        0x4000_3280
        0       R      display_672x24_drf_start_pause  1'h0
        1       R      display_672x24_drf_bist_fail    1'h0
        2       R      display_672x24_drf_bist_done    1'h0
        3       R      display_672x24_bist_fail        1'h0
        4       R      display_672x24_bist_done        1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    display_672x24_bist_grp_en      1'h0
        26      R/W    display_672x24_dyn_read_en      1'h0
        27      R/W    display_672x24_bist_loop_mode   1'h0
        28      R/W    display_672x24_drf_test_resume  1'h0
        29      R/W    display_672x24_drf_bist_mode    1'h0
        30      R/W    display_672x24_bist_mode        1'h0
        31      R/W    display_672x24_bist_rstn        1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x280;
        struct
        {
            __I uint32_t display_672x24_drf_start_pause: 1;
            __I uint32_t display_672x24_drf_bist_fail: 1;
            __I uint32_t display_672x24_drf_bist_done: 1;
            __I uint32_t display_672x24_bist_fail: 1;
            __I uint32_t display_672x24_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t display_672x24_bist_grp_en: 1;
            __IO uint32_t display_672x24_dyn_read_en: 1;
            __IO uint32_t display_672x24_bist_loop_mode: 1;
            __IO uint32_t display_672x24_drf_test_resume: 1;
            __IO uint32_t display_672x24_drf_bist_mode: 1;
            __IO uint32_t display_672x24_bist_mode: 1;
            __IO uint32_t display_672x24_bist_rstn: 1;
        } BITS_280;
    } u_280;

    /* 0x284        0x4000_3284
        0       R      gmac_512x32_drf_start_pause     1'h0
        2:1     R      gmac_512x32_drf_bist_fail       2'h0
        3       R      gmac_512x32_drf_bist_done       1'h0
        5:4     R      gmac_512x32_bist_fail           2'h0
        6       R      gmac_512x32_bist_done           1'h0
        23:7    R      RSVD                            17'h0
        25:24   R/W    gmac_512x32_bist_grp_en         2'h0
        26      R/W    gmac_512x32_dyn_read_en         1'h0
        27      R/W    gmac_512x32_bist_loop_mode      1'h0
        28      R/W    gmac_512x32_drf_test_resume     1'h0
        29      R/W    gmac_512x32_drf_bist_mode       1'h0
        30      R/W    gmac_512x32_bist_mode           1'h0
        31      R/W    gmac_512x32_bist_rstn           1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x284;
        struct
        {
            __I uint32_t gmac_512x32_drf_start_pause: 1;
            __I uint32_t gmac_512x32_drf_bist_fail: 2;
            __I uint32_t gmac_512x32_drf_bist_done: 1;
            __I uint32_t gmac_512x32_bist_fail: 2;
            __I uint32_t gmac_512x32_bist_done: 1;
            __I uint32_t RESERVED_0: 17;
            __IO uint32_t gmac_512x32_bist_grp_en: 2;
            __IO uint32_t gmac_512x32_dyn_read_en: 1;
            __IO uint32_t gmac_512x32_bist_loop_mode: 1;
            __IO uint32_t gmac_512x32_drf_test_resume: 1;
            __IO uint32_t gmac_512x32_drf_bist_mode: 1;
            __IO uint32_t gmac_512x32_bist_mode: 1;
            __IO uint32_t gmac_512x32_bist_rstn: 1;
        } BITS_284;
    } u_284;

    /* 0x288        0x4000_3288
        0       R      pke_rom_bist_done               1'h0
        28:1    R      RSVD                            28'h0
        29      R/W    pke_rom_bist_grp_en             1'h0
        30      R/W    pke_rom_bist_mode               1'h0
        31      R/W    pke_rom_bist_rstn               1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x288;
        struct
        {
            __I uint32_t pke_rom_bist_done: 1;
            __I uint32_t RESERVED_0: 28;
            __IO uint32_t pke_rom_bist_grp_en: 1;
            __IO uint32_t pke_rom_bist_mode: 1;
            __IO uint32_t pke_rom_bist_rstn: 1;
        } BITS_288;
    } u_288;

    /* 0x28C        0x4000_328c
        31:0    R      pke_rom_misr_dataout_0_31_00    32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x28C;
        struct
        {
            __I uint32_t pke_rom_misr_dataout_0_31_00: 32;
        } BITS_28C;
    } u_28C;

    /* 0x290        0x4000_3290
        31:0    R      pke_rom_misr_dataout_0_63_32    32'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x290;
        struct
        {
            __I uint32_t pke_rom_misr_dataout_0_63_32: 32;
        } BITS_290;
    } u_290;

    /* 0x294        0x4000_3294
        0       R      pke_mmem_drf_start_pause        1'h0
        2:1     R      pke_mmem_drf_bist_fail          2'h0
        3       R      pke_mmem_drf_bist_done          1'h0
        5:4     R      pke_mmem_bist_fail              2'h0
        6       R      pke_mmem_bist_done              1'h0
        23:7    R      RSVD                            17'h0
        25:24   R/W    pke_mmem_bist_grp_en            2'h0
        26      R/W    pke_mmem_dyn_read_en            1'h0
        27      R/W    pke_mmem_bist_loop_mode         1'h0
        28      R/W    pke_mmem_drf_test_resume        1'h0
        29      R/W    pke_mmem_drf_bist_mode          1'h0
        30      R/W    pke_mmem_bist_mode              1'h0
        31      R/W    pke_mmem_bist_rstn              1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x294;
        struct
        {
            __I uint32_t pke_mmem_drf_start_pause: 1;
            __I uint32_t pke_mmem_drf_bist_fail: 2;
            __I uint32_t pke_mmem_drf_bist_done: 1;
            __I uint32_t pke_mmem_bist_fail: 2;
            __I uint32_t pke_mmem_bist_done: 1;
            __I uint32_t RESERVED_0: 17;
            __IO uint32_t pke_mmem_bist_grp_en: 2;
            __IO uint32_t pke_mmem_dyn_read_en: 1;
            __IO uint32_t pke_mmem_bist_loop_mode: 1;
            __IO uint32_t pke_mmem_drf_test_resume: 1;
            __IO uint32_t pke_mmem_drf_bist_mode: 1;
            __IO uint32_t pke_mmem_bist_mode: 1;
            __IO uint32_t pke_mmem_bist_rstn: 1;
        } BITS_294;
    } u_294;

    /* 0x298        0x4000_3298
        0       R      pke_tmem_drf_start_pause        1'h0
        2:1     R      pke_tmem_drf_bist_fail          2'h0
        3       R      pke_tmem_drf_bist_done          1'h0
        5:4     R      pke_tmem_bist_fail              2'h0
        6       R      pke_tmem_bist_done              1'h0
        23:7    R      RSVD                            17'h0
        25:24   R/W    pke_tmem_bist_grp_en            2'h0
        26      R/W    pke_tmem_dyn_read_en            1'h0
        27      R/W    pke_tmem_bist_loop_mode         1'h0
        28      R/W    pke_tmem_drf_test_resume        1'h0
        29      R/W    pke_tmem_drf_bist_mode          1'h0
        30      R/W    pke_tmem_bist_mode              1'h0
        31      R/W    pke_tmem_bist_rstn              1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x298;
        struct
        {
            __I uint32_t pke_tmem_drf_start_pause: 1;
            __I uint32_t pke_tmem_drf_bist_fail: 2;
            __I uint32_t pke_tmem_drf_bist_done: 1;
            __I uint32_t pke_tmem_bist_fail: 2;
            __I uint32_t pke_tmem_bist_done: 1;
            __I uint32_t RESERVED_0: 17;
            __IO uint32_t pke_tmem_bist_grp_en: 2;
            __IO uint32_t pke_tmem_dyn_read_en: 1;
            __IO uint32_t pke_tmem_bist_loop_mode: 1;
            __IO uint32_t pke_tmem_drf_test_resume: 1;
            __IO uint32_t pke_tmem_drf_bist_mode: 1;
            __IO uint32_t pke_tmem_bist_mode: 1;
            __IO uint32_t pke_tmem_bist_rstn: 1;
        } BITS_298;
    } u_298;

    /* 0x29C        0x4000_329c
        0       R      audio_ad_ram_drf_start_pause    1'h0
        2:1     R      audio_ad_ram_drf_bist_fail      2'h0
        3       R      audio_ad_ram_drf_bist_done      1'h0
        5:4     R      audio_ad_ram_bist_fail          2'h0
        6       R      audio_ad_ram_bist_done          1'h0
        23:7    R      RSVD                            17'h0
        25:24   R/W    audio_ad_ram_bist_grp_en        2'h0
        26      R/W    audio_ad_ram_dyn_read_en        1'h0
        27      R/W    audio_ad_ram_bist_loop_mode     1'h0
        28      R/W    audio_ad_ram_drf_test_resume    1'h0
        29      R/W    audio_ad_ram_drf_bist_mode      1'h0
        30      R/W    audio_ad_ram_bist_mode          1'h0
        31      R/W    audio_ad_ram_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x29C;
        struct
        {
            __I uint32_t audio_ad_ram_drf_start_pause: 1;
            __I uint32_t audio_ad_ram_drf_bist_fail: 2;
            __I uint32_t audio_ad_ram_drf_bist_done: 1;
            __I uint32_t audio_ad_ram_bist_fail: 2;
            __I uint32_t audio_ad_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 17;
            __IO uint32_t audio_ad_ram_bist_grp_en: 2;
            __IO uint32_t audio_ad_ram_dyn_read_en: 1;
            __IO uint32_t audio_ad_ram_bist_loop_mode: 1;
            __IO uint32_t audio_ad_ram_drf_test_resume: 1;
            __IO uint32_t audio_ad_ram_drf_bist_mode: 1;
            __IO uint32_t audio_ad_ram_bist_mode: 1;
            __IO uint32_t audio_ad_ram_bist_rstn: 1;
        } BITS_29C;
    } u_29C;

