rtkconnectivity/hal_realtek/bee/rtl87x2g/rom/inc/platform_reg.h
    /* 0x2A0        0x4000_32a0
        0       R      audio_da_ram_drf_start_pause    1'h0
        1       R      audio_da_ram_drf_bist_fail      1'h0
        2       R      audio_da_ram_drf_bist_done      1'h0
        3       R      audio_da_ram_bist_fail          1'h0
        4       R      audio_da_ram_bist_done          1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    audio_da_ram_bist_grp_en        1'h0
        26      R/W    audio_da_ram_dyn_read_en        1'h0
        27      R/W    audio_da_ram_bist_loop_mode     1'h0
        28      R/W    audio_da_ram_drf_test_resume    1'h0
        29      R/W    audio_da_ram_drf_bist_mode      1'h0
        30      R/W    audio_da_ram_bist_mode          1'h0
        31      R/W    audio_da_ram_bist_rstn          1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x2A0;
        struct
        {
            __I uint32_t audio_da_ram_drf_start_pause: 1;
            __I uint32_t audio_da_ram_drf_bist_fail: 1;
            __I uint32_t audio_da_ram_drf_bist_done: 1;
            __I uint32_t audio_da_ram_bist_fail: 1;
            __I uint32_t audio_da_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t audio_da_ram_bist_grp_en: 1;
            __IO uint32_t audio_da_ram_dyn_read_en: 1;
            __IO uint32_t audio_da_ram_bist_loop_mode: 1;
            __IO uint32_t audio_da_ram_drf_test_resume: 1;
            __IO uint32_t audio_da_ram_drf_bist_mode: 1;
            __IO uint32_t audio_da_ram_bist_mode: 1;
            __IO uint32_t audio_da_ram_bist_rstn: 1;
        } BITS_2A0;
    } u_2A0;

    /* 0x2A4        0x4000_32a4
        0       R      can_ram_drf_start_pause         1'h0
        1       R      can_ram_drf_bist_fail           1'h0
        2       R      can_ram_drf_bist_done           1'h0
        3       R      can_ram_bist_fail               1'h0
        4       R      can_ram_bist_done               1'h0
        24:5    R      RSVD                            20'h0
        25      R/W    can_ram_bist_grp_en             1'h0
        26      R/W    can_ram_dyn_read_en             1'h0
        27      R/W    can_ram_bist_loop_mode          1'h0
        28      R/W    can_ram_drf_test_resume         1'h0
        29      R/W    can_ram_drf_bist_mode           1'h0
        30      R/W    can_ram_bist_mode               1'h0
        31      R/W    can_ram_bist_rstn               1'h0
    */
    union
    {
        __IO uint32_t reg_bist_0x2A4;
        struct
        {
            __I uint32_t can_ram_drf_start_pause: 1;
            __I uint32_t can_ram_drf_bist_fail: 1;
            __I uint32_t can_ram_drf_bist_done: 1;
            __I uint32_t can_ram_bist_fail: 1;
            __I uint32_t can_ram_bist_done: 1;
            __I uint32_t RESERVED_0: 20;
            __IO uint32_t can_ram_bist_grp_en: 1;
            __IO uint32_t can_ram_dyn_read_en: 1;
            __IO uint32_t can_ram_bist_loop_mode: 1;
            __IO uint32_t can_ram_drf_test_resume: 1;
            __IO uint32_t can_ram_drf_bist_mode: 1;
            __IO uint32_t can_ram_bist_mode: 1;
            __IO uint32_t can_ram_bist_rstn: 1;
        } BITS_2A4;
    } u_2A4;

    __IO uint32_t RSVD_0x2a8[9];

    /* 0x2CC        0x4000_32cc
        31:0    R/W    spic0_pgm_fifo_init_0           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_0;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_0: 32;
        } BITS_2CC;
    } u_2CC;

    /* 0x2D0        0x4000_32d0
        31:0    R/W    spic0_pgm_fifo_init_1           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_1;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_1: 32;
        } BITS_2D0;
    } u_2D0;

    /* 0x2D4        0x4000_32d4
        31:0    R/W    spic0_pgm_fifo_init_2           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_2;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_2: 32;
        } BITS_2D4;
    } u_2D4;

    /* 0x2D8        0x4000_32d8
        31:0    R/W    spic0_pgm_fifo_init_3           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_3;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_3: 32;
        } BITS_2D8;
    } u_2D8;

    /* 0x2DC        0x4000_32dc
        31:0    R/W    spic0_pgm_fifo_init_4           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_4;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_4: 32;
        } BITS_2DC;
    } u_2DC;

    /* 0x2E0        0x4000_32e0
        31:0    R/W    spic0_pgm_fifo_init_5           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_5;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_5: 32;
        } BITS_2E0;
    } u_2E0;

    /* 0x2E4        0x4000_32e4
        31:0    R/W    spic0_pgm_fifo_init_6           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_6;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_6: 32;
        } BITS_2E4;
    } u_2E4;

    /* 0x2E8        0x4000_32e8
        31:0    R/W    spic0_pgm_fifo_init_7           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_INIT_7;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_init_7: 32;
        } BITS_2E8;
    } u_2E8;

    /* 0x2EC        0x4000_32ec
        4:0     R/W    spic0_pgm_fifo_wptr_init        5'h0
        31:5    R      RSVD                            27'h0
    */
    union
    {
        __IO uint32_t REG_SPIC0_PGM_FIFO_WPTR_INIT;
        struct
        {
            __IO uint32_t spic0_pgm_fifo_wptr_init: 5;
            __I uint32_t RESERVED_0: 27;
        } BITS_2EC;
    } u_2EC;

    /* 0x2F0        0x4000_32f0
        31:0    R/W    spic1_pgm_fifo_init_0           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_0;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_0: 32;
        } BITS_2F0;
    } u_2F0;

    /* 0x2F4        0x4000_32f4
        31:0    R/W    spic1_pgm_fifo_init_1           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_1;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_1: 32;
        } BITS_2F4;
    } u_2F4;

    /* 0x2F8        0x4000_32f8
        31:0    R/W    spic1_pgm_fifo_init_2           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_2;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_2: 32;
        } BITS_2F8;
    } u_2F8;

    /* 0x2FC        0x4000_32fc
        31:0    R/W    spic1_pgm_fifo_init_3           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_3;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_3: 32;
        } BITS_2FC;
    } u_2FC;

    /* 0x300        0x4000_3300
        31:0    R/W    spic1_pgm_fifo_init_4           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_4;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_4: 32;
        } BITS_300;
    } u_300;

    /* 0x304        0x4000_3304
        31:0    R/W    spic1_pgm_fifo_init_5           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_5;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_5: 32;
        } BITS_304;
    } u_304;

    /* 0x308        0x4000_3308
        31:0    R/W    spic1_pgm_fifo_init_6           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_6;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_6: 32;
        } BITS_308;
    } u_308;

    /* 0x30C        0x4000_330c
        31:0    R/W    spic1_pgm_fifo_init_7           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_INIT_7;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_init_7: 32;
        } BITS_30C;
    } u_30C;

    /* 0x310        0x4000_3310
        4:0     R/W    spic1_pgm_fifo_wptr_init        5'h0
        31:5    R      RSVD                            27'h0
    */
    union
    {
        __IO uint32_t REG_SPIC1_PGM_FIFO_WPTR_INIT;
        struct
        {
            __IO uint32_t spic1_pgm_fifo_wptr_init: 5;
            __I uint32_t RESERVED_0: 27;
        } BITS_310;
    } u_310;

    /* 0x314        0x4000_3314
        31:0    R/W    spic2_pgm_fifo_init_0           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_0;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_0: 32;
        } BITS_314;
    } u_314;

    /* 0x318        0x4000_3318
        31:0    R/W    spic2_pgm_fifo_init_1           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_1;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_1: 32;
        } BITS_318;
    } u_318;

    /* 0x31C        0x4000_331c
        31:0    R/W    spic2_pgm_fifo_init_2           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_2;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_2: 32;
        } BITS_31C;
    } u_31C;

    /* 0x320        0x4000_3320
        31:0    R/W    spic2_pgm_fifo_init_3           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_3;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_3: 32;
        } BITS_320;
    } u_320;

    /* 0x324        0x4000_3324
        31:0    R/W    spic2_pgm_fifo_init_4           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_4;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_4: 32;
        } BITS_324;
    } u_324;

    /* 0x328        0x4000_3328
        31:0    R/W    spic2_pgm_fifo_init_5           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_5;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_5: 32;
        } BITS_328;
    } u_328;

    /* 0x32C        0x4000_332c
        31:0    R/W    spic2_pgm_fifo_init_6           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_6;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_6: 32;
        } BITS_32C;
    } u_32C;

    /* 0x330        0x4000_3330
        31:0    R/W    spic2_pgm_fifo_init_7           32'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_INIT_7;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_init_7: 32;
        } BITS_330;
    } u_330;

    /* 0x334        0x4000_3334
        4:0     R/W    spic2_pgm_fifo_wptr_init        5'h0
        31:5    R      RSVD                            27'h0
    */
    union
    {
        __IO uint32_t REG_SPIC2_PGM_FIFO_WPTR_INIT;
        struct
        {
            __IO uint32_t spic2_pgm_fifo_wptr_init: 5;
            __I uint32_t RESERVED_0: 27;
        } BITS_334;
    } u_334;

} SoC_VENDOR_REG_TypeDef;


#define SOC_VENDOR_REG_BASE             0x40003000UL
#define VENDOR_REG_BASE                 SOC_VENDOR_REG_BASE

#define SoC_VENDOR                      ((SoC_VENDOR_REG_TypeDef    *) SOC_VENDOR_REG_BASE)

#endif //#define PLATFORM_REG_H 
